{
    "es": {
        "nav.experiencia": "Experiencia",
        "nav.sobre_mi": "Sobre mí",
        "nav.contacto": "Contacto",
        "nav.proyectos.title": "Proyectos",
        "nav.idioma.title": "Idioma",
        "intro.titulo": "¡Hola! Soy",
        "intro.name": "Guille",
        "intro.parrafo": "Estoy aprendiendo a programar y a trabajar con tecnologías como Java, SQL, HTML, CSS y JS. Me apasiona resolver problemas y estoy motivado por aprender cada día más.",
        "experiencia.titulo": "Experiencia laboral",
        "experiencia.puesto": "Desarrollo web y soporte técnico",
        "experiencia.fecha": "Abril - Junio 2024",
        "experiencia.desc1": "Desarrollo de la web para el local, principalmente en HTML y CSS.",
        "experiencia.desc2": "Atención al cliente, reparación de teléfonos móviles y portátiles, así como mantenimiento de equipos informáticos.",
        "tecnologias.titulo": "Tecnologías",
        "proyectos.titulo": "Proyectos",
        "proyectos.doctor_phone.titulo": "Doctor Phone - Página web para un local de reparación de dispositivos móviles",
        "proyectos.doctor_phone.desc": "Página web simple y minimalista. Creada desde cero con HTML, CSS y JS.",
        "proyectos.gsm_smart.titulo": "GSM Smart - Página web para un local de reparación y venta de dispositivos móviles",
        "proyectos.gsm_smart.desc": "Página web con eCommerce integrado. Creada en WordPress utilizando el tema Blocksy y el editor Gutenberg.",
        "proyectos.gsm_smart.en_desarrollo": "En desarrollo",
        "proyectos.calculadora.titulo": "Calculadora - Aplicación de cálculo básico en terminal",
        "proyectos.calculadora.desc": "Calculadora en Java con soporte para suma, resta, multiplicación, división y números decimales.",
        "botones.preview": "Preview",
        "botones.codigo": "Código",
        "sobre_mi.titulo": "Sobre mí",
        "sobre_mi.parrafo1": "Me llamo <span class='res-sobre-mi'>Guillermo</span> y me apasiona el <span class='res-sobre-mi'>desarrollo web</span> y la <span class='res-sobre-mi'>programación</span>. Siempre me ha interesado la <span class='res-sobre-mi'>informática</span> y he disfrutado aprendiendo y curioseando por mi cuenta. Actualmente me encuentro cursando <span class='res-sobre-mi'>1º de DAM</span>.",
        "sobre_mi.parrafo2": "He desarrollado una <span class='res-sobre-mi'>página web</span> para un local de reparación de dispositivos móviles y actualmente estoy <span class='res-sobre-mi'>aprendiendo Java</span>, dando mis primeros pasos en la <span class='res-sobre-mi'>programación</span>. Me interesa seguir explorando distintas áreas del desarrollo y mejorando en lo que me gusta.",
        "sobre_mi.parrafo3": "En el futuro, me gustaría trabajar en <span class='res-sobre-mi'>startups</span> y formar parte de <span class='res-sobre-mi'>proyectos innovadores</span> que me desafíen a seguir creciendo y aprendiendo como desarrollador.",
        "footer.mensaje": "Siempre abierto a nuevas oportunidades. Escríbeme:"
    },
    "en": {
        "nav.experiencia": "Work Experience",
        "nav.sobre_mi": "About me",
        "nav.contacto": "Contact",
        "nav.proyectos.title": "Projects",
        "nav.idioma.title": "Language",
        "intro.titulo": "Hello! I'm",
        "intro.name": "Guille",
        "intro.parrafo": "I'm learning to program and work with technologies like Java, SQL, HTML, CSS, and JS. I'm passionate about problem-solving and motivated to learn more every day.",
        "experiencia.titulo": "Work Experience",
        "experiencia.puesto": "Web Development & Technical Support",
        "experiencia.fecha": "April - June 2024",
        "experiencia.desc1": "Development of the website for the store, mainly using HTML and CSS.",
        "experiencia.desc2": "Customer service, repair of mobile phones and laptops, as well as maintenance of computer equipment.",
        "tecnologias.titulo": "Technologies",
        "proyectos.titulo": "Projects",
        "proyectos.doctor_phone.titulo": "Doctor Phone - Website for a Mobile Device Repair Shop",
        "proyectos.doctor_phone.desc": "Simple and minimalist website. Built from scratch with HTML, CSS, and JS.",
        "proyectos.gsm_smart.titulo": "GSM Smart - Website for a Mobile Device Repair and Sales Store",
        "proyectos.gsm_smart.desc": "Website with integrated eCommerce. Created in WordPress using the Blocksy theme and Gutenberg editor.",
        "proyectos.gsm_smart.en_desarrollo": "In development",
        "proyectos.calculadora.titulo": "Calculator - Basic Terminal Calculation Application",
        "proyectos.calculadora.desc": "Calculator in Java with support for addition, subtraction, multiplication, division, and decimal numbers.",
        "botones.preview": "Preview",
        "botones.codigo": "Code",
        "sobre_mi.titulo": "About Me",
        "sobre_mi.parrafo1": "My name is <span class='res-sobre-mi'>Guillermo</span> and I am passionate about <span class='res-sobre-mi'>web development</span> and <span class='res-sobre-mi'>programming</span>. I have always been interested in <span class='res-sobre-mi'>computing</span> and have enjoyed learning and exploring on my own. I am currently studying <span class='res-sobre-mi'>1st year of DAM</span> (Development of Multiplatform Applications).",
        "sobre_mi.parrafo2": "I have developed a <span class='res-sobre-mi'>website</span> for a mobile device repair shop and am currently <span class='res-sobre-mi'>learning Java</span>, taking my first steps in <span class='res-sobre-mi'>programming</span>. I am interested in continuing to explore different areas of development and improving in what I love.",
        "sobre_mi.parrafo3": "In the future, I would like to work in <span class='res-sobre-mi'>startups</span> and be part of <span class='res-sobre-mi'>innovative projects</span> that challenge me to keep growing and learning as a developer.",
        "footer.mensaje": "Always open to new opportunities. Write to me:"
    }
}